# 1.算数运算符
# 用于执行基本的算数运算的符号，作用域一个或多个操作数上，产生一个计算结果
# 加法+  减法-  乘法*  除法/  整除//  取余/求模%  幂指数**

print("10 / 4=", 10 / 4)
print("10 // 4=", 10 // 4)
print("10 % 4=", 10 % 4)
print("10**4=", 10**4)

# 算数运算符的优先级 ** → * /  //  % → + -
print("0.1 + 10 / 4**2=", 0.1 + 10 / 4**2)

# 案例：输入两个数x和y，输出x+y,x-y
x = float(input("x = "))
y = float(input("y = "))
print("x + y = ", x + y)
print("x - y = ", x - y)
# input()获取的数据都是字符串类型
# int和float都存在的时候，使用float()

# 0.5 - 0.4 = 0.09999999999998
# 精度损失：由于计算机底层是基于二进制进行数据的存储与处理的，二进制是无法准确地表示所有的小数
# 因此涉及到浮点数的运算时，可能损失精度。


# 2.赋值运算符
# 赋值运算符是编程语言中用于将值（或表达式的结果）保存到变量中的运算符
# 赋值运算符 =
# 加法赋值运算符 +=
# 减法赋值运算符 -=
# 乘法赋值运算符 *=
# 除法赋值运算符 /=
# 取模赋值运算符 %=
# 取整除赋值运算符 //=
# 幂赋值运算符 **=
num = 85
print("num += 10: ", num + 10)
print("num -= 10: ", num - 10)
print("num *= 10: ", num * 10)
print("num /= 10: ", num / 10)
print("num // 10: ", num // 10)
print("num % 3: ", num % 3)
print("num ** 2: ", num ** 2)


# 3.比较运算符
# 也叫关系运算符，用于比较两个值之间的关系。
# 会计算运算符两边的表达式，然后返回一个布尔值作为结果。
# True表示比较关系成立；False表示比较关系不成立
# 等于 ==
# 不等于 !=
# 大于 >
# 大于等于 >=
# 小于 <
# 小于等于 <=
print("100 == 100: ", 100 == 100)
print("'100' == '100': ", '100' == '100')
print("100 != 100: ", 100 != 100)


# 4.逻辑运算符








