# 1.编程语言：人类与计算机之间信息交流的一种特殊的语言。
# python是一门语法简单、容易上手且应用非常广泛的编程语言

# 2.python解释器 - 翻译程序
# python官网

# 3.第一个python程序
print("Hello World！")
print("hello python！") #python默认换行符\n
# exit() #退出python解释器

# 环境变量：一般指在操作系统中存储的用来指定程序运行时所需的一些参数
# 如：临时文件夹位置和系统文件的访问路径等
# 用户变量、系统变量
# 作用：告诉操作系统，在命令行或终端中输入一个命令时，应该去哪些目录中寻找这个命令对应的可执行文件

# 4.python开发工具
# 集成开发环境IDE：集成了代码编写功能、分析功能、调试功能等一体化的集成环境的开发软件
# VSCode、PyCharm

# pycharm - Jetbrains公司

# 注释：对代码进行解释说明，给开发人员看的

# 创建项目时解释器的类型
# 项目venv - 在项目当中创建虚拟环境
# .idea - 保存项目的配置信息
# .venv - 虚拟环境，保存项目的环境信息
# 通过虚拟的运行环境，可以保证每一个python项目都在一个相对独立的隔离的运行环境中运行，项目之间互不影响

